 # Brewfile - declarative macOS package manifest for `brew bundle`
# Reflects the current-machine snapshot; install with: brew bundle --file=Brewfile

# ==============================================================================
# HOMEBREW TAPS (Third-Party Repositories)
# ==============================================================================
tap "maxghenis/tap", trusted: true # Third-party formula tap (auto-trusted on install)

# ==============================================================================
# SHELL, TERMINAL & PROMPT
# ==============================================================================
brew "bash"                    # Updated Bourne-Again SHell (macOS default is heavily outdated)
brew "zsh"                     # The Z shell engine
brew "zsh-autosuggestions"     # Fish-like fast autosuggestions for Zsh
brew "zsh-syntax-highlighting" # Real-time syntax highlighting for Zsh
brew "starship"                # Blazing fast, cross-shell prompt written in Rust
brew "zoxide"                  # Smarter, faster 'cd' alternative that remembers your habits
cask "ghostty"                 # GPU-accelerated, incredibly fast terminal emulator

# ==============================================================================
# CORE DEVELOPER & CLI TOOLS
# ==============================================================================
brew "git"                     # Version control system
brew "gh"                      # Official GitHub CLI tool
brew "fnm"                     # Fast Node Manager (Rust-based, replaces nvm)
brew "node"                    # JavaScript runtime (also managed per-project via fnm)
brew "go"                      # The Go programming language
brew "rustup"                  # Installer for the Rust systems programming toolchain
brew "php"                     # PHP programming language
brew "yarn"                    # Node package manager
brew "uv"                      # Extremely fast Python package installer/resolver (Rust)
brew "pipx"                    # Installs and runs Python CLI apps in isolated envs
brew "micro"                   # Terminal text editor with intuitive, GUI-like keybinds
brew "pup"                     # Command-line tool for parsing HTML
brew "cloudflare-wrangler"     # CLI for building and deploying Cloudflare Workers
cask "orbstack"                # Lightning-fast, lightweight Docker Desktop alternative
cask "nova"                    # Panic's beautifully designed native macOS code editor
cask "github"                  # GitHub Desktop GUI
brew "mas"                     # Mac App Store CLI installer for a fully complete Brewfile
brew "tg-pro"                  # Temperature monitoring, fan control and diagnostics


# ==============================================================================
# AI & LLM TOOLS
# ==============================================================================
brew "ollama"                  # Run large language models (Llama, Mistral, etc.) locally
brew "mlx-lm"                  # Run LLMs locally on Apple Silicon via Apple's MLX framework
cask "lm-studio"               # Discover, download, and run local LLMs with a GUI
cask "comfy"                   # Node-based image, video, and audio generation (ComfyUI)
cask "claude"                  # Anthropic's official Claude AI desktop app

# ==============================================================================
# SYSTEM UTILITIES & FILE MANAGEMENT
# ==============================================================================
brew "btop"                    # Beautiful, interactive terminal resource monitor
brew "tree"                    # Directory tree visualizer
brew "fd"                      # Faster, colorized alternative to the 'find' command
brew "fzf"                     # Command-line fuzzy finder
brew "fclones"                 # Efficient duplicate file finder
brew "navi"                    # Interactive cheatsheet tool for the command line
brew "mackup"                  # Backs up application settings to iCloud/Drive
cask "a-better-finder-rename"  # Advanced bulk file renaming utility
cask "appcleaner"              # Thoroughly uninstalls Mac apps and their hidden files
cask "daisydisk"               # Visualizes disk usage to help clear space
cask "gemini"                  # Finds and removes duplicate and similar files (MacPaw)
cask "keka"                    # Advanced file archiver and extractor
cask "cleanshot"               # Premium screen capture and recording tool

# ==============================================================================
# SECURITY & PRIVACY
# ==============================================================================
cask "1password"               # Password manager behind a single master password
cask "1password-cli"           # Command-line interface for 1Password
cask "adguard"                 # System-wide ad and tracker blocker

# ==============================================================================
# MAC SYSTEM TWEAKS & CUSTOMIZATION
# ==============================================================================
cask "alfred"                  # Application launcher and productivity/automation tool
cask "bettertouchtool"         # Deep customization for trackpad gestures and shortcuts
cask "betterdisplay"           # Display management and virtual-monitor utility
cask "bettermouse"             # Smooths and customizes third-party mouse behavior
cask "swish"                   # Trackpad gesture-based window management
cask "thaw@beta"               # Open-source menu bar manager (replaces Bartender)
cask "karabiner-elements"      # Deep, low-level keyboard remapper

# ==============================================================================
# BROWSERS
# ==============================================================================
cask "google-chrome@beta"      # Google Chrome (Beta channel)
cask "ungoogled-chromium"      # Chromium stripped of Google telemetry and tracking
cask "choosy"                  # Prompts you to choose which browser opens a link

# ==============================================================================
# COMMUNICATION & CHAT
# ==============================================================================
cask "beeper"                  # Universal chat app integrating multiple networks
cask "discord"                 # Voice and text chat for communities
cask "signal"                  # End-to-end encrypted secure messenger
cask "telegram"                # Native macOS Telegram messaging client
cask "whatsapp"                # Meta's instant messaging application
cask "microsoft-teams"         # Meet, chat, call, and collaborate in one place
cask "fastmail"                # Desktop client for Fastmail email

# ==============================================================================
# PRODUCTIVITY & ENTERTAINMENT
# ==============================================================================
cask "raindropio"              # All-in-one bookmark and link manager
cask "google-drive"            # Desktop sync client for Google Drive
cask "elgato-stream-deck"      # Control software for Elgato Stream Deck hardware
cask "iina"                    # Modern, native macOS media player
cask "transmission"            # Fast, lightweight BitTorrent client

# ==============================================================================
# GAMING
# ==============================================================================
cask "steam"                   # Valve's video game digital distribution platform
cask "epic-games"              # Launcher for the Epic Games store
cask "battle-net"              # Blizzard's online gaming platform and launcher
cask "crossover"               # Run Windows software and games on macOS (CodeWeavers)

# ==============================================================================
# FONTS
# ==============================================================================
cask "font-hack-nerd-font"     # Developer font patched with terminal icons and glyphs

# ==============================================================================
# MAC APP STORE
# ==============================================================================
mas "1Password for Safari", id: 1569813296
mas "AutoMounter", id: 1160435653
mas "ColorSlurp", id: 1287239339
mas "Copilot", id: 6738511300
mas "djay Pro", id: 450527929
mas "Draw Things", id: 6444050820
mas "Fantastical", id: 975937182
mas "Keynote", id: 361285480
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Parcel", id: 375589283
mas "PastePal", id: 1503446680
mas "Pixelmator Pro", id: 6746662575
mas "Reeder", id: 6475002485
mas "Screens 5", id: 1663047912
mas "Snippety", id: 1530751461
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835